public class Main {
    public static void main(String[] args) {
        TicTacToe game = new TicTacToe();
        game.startGame();
    }
}

// Добро пожаловать в Крестики-Нолики!
//Введите имя первого игрока (X): Alex
//Введите имя второго игрока (O): Vaskes
//
//Текущее поле:
//- - - 
//- - - 
//- - - 
//
//Alex (X), ваш ход!
//Введите номер строки (0-2): 1
//Введите номер столбца (0-2): 1
//
//Текущее поле:
//- - - 
//- X - 
//- - - 
//
//Vaskes (O), ваш ход!
//Введите номер строки (0-2): 1
//Введите номер столбца (0-2): 1
//Эта клетка уже занята! Попробуйте другую.
//Vaskes (O), ваш ход!
//Введите номер строки (0-2): 0
//Введите номер столбца (0-2): 1
//
//Текущее поле:
//- O - 
//- X - 
//- - - 
//
//Alex (X), ваш ход!
//Введите номер строки (0-2): 0
//Введите номер столбца (0-2): 0
//
//Текущее поле:
//X O - 
//- X - 
//- - - 
//
//Vaskes (O), ваш ход!
//Введите номер строки (0-2): 0
//Введите номер столбца (0-2): 2
//
//Текущее поле:
//X O O 
//- X - 
//- - - 
//
//Alex (X), ваш ход!
//Введите номер строки (0-2): 2
//Введите номер столбца (0-2): 2
//
//Текущее поле:
//X O O 
//- X - 
//- - X 
//
//Поздравляем! Alex победил!
//Хотите сыграть еще раз? (да/нет): 
